УчетВУправляющихДляГит1/src/InformationRegisters/ПолучателиПлатежаЗарплатногоПроекта/ПолучателиПлатежаЗарплатногоПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолучателиПлатежаЗарплатногоПроекта</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.ЗарплатныеПроекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыМестВыплатыЗарплаты/ВидыМестВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМестВыплатыЗарплаты</name>
  <enumValues>
    <name>Касса</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатныйПроект</name>
  </enumValues>
  <enumValues>
    <name>Раздатчик</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/ПолучателиПлатежаЗарплатногоПроекта/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПолучателяПлатежаЗарплатногоПроекта(Организация, Контрагент, СчетКонтрагента, ПлатежнаяВедомость) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ НЕ ЗначениеЗаполнено(ПлатежнаяВедомость)
		Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПлатежнаяВедомость) <> Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		ЗарплатныйПроект = Справочники.ЗарплатныеПроекты.ПустаяСсылка();
	Иначе
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "ЗарплатныйПроект");
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПолучателиПлатежаЗарплатногоПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация      = Организация;
	МенеджерЗаписи.ЗарплатныйПроект = ЗарплатныйПроект;
	МенеджерЗаписи.Контрагент       = Контрагент;
	МенеджерЗаписи.СчетКонтрагента  = СчетКонтрагента;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция РеквизитыПолучателяПлатежаЗарплатногоПроекта(Организация, ПлатежнаяВедомость) Экспорт
	
	РеквизитыПолучателяПлатежа = Новый Структура("Контрагент, СчетКонтрагента",
		Справочники.Контрагенты.ПустаяСсылка(), Справочники.БанковскиеСчета.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(ПлатежнаяВедомость) Тогда
		Возврат РеквизитыПолучателяПлатежа;
	КонецЕсли;
	
	Если ТипЗнч(ПлатежнаяВедомость) <> Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
		Возврат РеквизитыПолучателяПлатежа;
	КонецЕсли;
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "ВидМестаВыплаты") = Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект Тогда
			ЗарплатныйПроект = Справочники.ЗарплатныеПроекты.ПустаяСсылка();
		Иначе
			Возврат РеквизитыПолучателяПлатежа;
		КонецЕсли;
	Иначе
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "ЗарплатныйПроект");
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПолучателиПлатежаЗарплатногоПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация      = Организация;
	МенеджерЗаписи.ЗарплатныйПроект = ЗарплатныйПроект;
	МенеджерЗаписи.Прочитать();
	
	РеквизитыПолучателяПлатежа.Контрагент      = МенеджерЗаписи.Контрагент;
	РеквизитыПолучателяПлатежа.СчетКонтрагента = МенеджерЗаписи.СчетКонтрагента;
	
	Возврат РеквизитыПолучателяПлатежа;
	
КонецФункции

#КонецОбласти

#КонецЕсли
